app/Http/Controllers/Api/V1/DashboardController.php

select * from `site_sections` where `key` = 'testimonial-section' limit 1
---
        }

        // Testimonial Data
        $testimonial =  SiteSections::where('key', 'testimonial-section')->first();