app/Http/Controllers/SiteController.php

select * from `events` where `status` = 1 order by `id` desc limit 2
---
    public function home(){

        $basic_settings = BasicSettingsProvider::get();
        $page_title = $basic_settings->site_title ?? "Home";
        $section_slug = Str::slug(SiteSectionConst::HOME_BANNER);
        $homeBanner = SiteSections::getData( $section_slug)->first();
        $campaigns = Campaign::getData(1)->orderBy('id','desc')->take(3)->get();
        $recent_events = Event::with('category:id,name')->where('status', 1)->orderBy('id', 'desc')->limit(2)->get();

select * from `campaigns` where `status` = 1 and `status` = 1 order by `id` desc
---
    public function donation(){
        $page_title = __('Donation');
        $sub_page_title = "Donation Listing";
        $campaigns = Campaign::getData(1)->orderBy('id', 'desc')->where('status', 1)->get();

select * from `campaigns` where `campaigns`.`id` = '9' limit 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'add-money' and `status` = 1)
---
    public function campaignDetails($id,$slug){
        $page_title = __('Donation Details');
        $sub_page_title = "Donation";
        $campaign_id = $id;
        $campaign_slug = $slug;

        $campaign = Campaign::findOrFail($id);
        $payment_gateways_currencies = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::add_money_slug());
            $gateway->where('status', 1);
        })->get();

select * from `events` where `status` = 1 order by `id` desc limit 3
select * from `events` where `status` = 1 limit 15 offset 0
select count(*) as aggregate from `events` where `status` = 1
select * from `category_types` where `category_types`.`id` in (7)
select * from `events` where `events`.`category_id` in (7, 8, 9, 10, 11, 12)
---
    public function events(){
        $page_title = __('Events');
        $sub_page_title = "Recent Events";
        $recent_events = Event::with('category:id,name')->where('status', 1)->orderBy('id', 'desc')->limit(3)->get();
        $events = Event::with('category')->where('status', 1)->paginate();
        $categories = CategoryType::active()->with('events')->where('type', 2)->orderBy('id','desc')->get();