app/Http/Controllers/Admin/CampaignController.php

    public function __construct()
    {
        $this->languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->get();
---
select * from `languages` where not `code` = 'en'

    public function index() {
        $page_title = __('Donation Section');
        $languages = $this->languages;
        $data = Campaign::orderBy('id', 'desc')->paginate();
---
select * from `campaigns` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `campaigns`