app/Http/Controllers/Admin/DashboardController.php

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 1 and date(`created_at`) >= '2025-02-01' and date(`created_at`) <= '2025-02-03'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) >= '2025-01-01' and date(`created_at`) <= '2025-01-31'
---
    public function index()
    {
        $page_title = __('Dashboard');

        $last_month_start =  date('Y-m-01', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $last_month_end =  date('Y-m-31', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_month_start = date('Y-m-01');
        $this_month_end = date('Y-m-d');
        $this_weak = date('Y-m-d', strtotime('-1 week', strtotime(date('Y-m-d'))));
        $this_month = date('Y-m-d', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_year = date('Y-m-d', strtotime('-1 year', strtotime(date('Y-m-d'))));

        // Dashboard box data
        // Add Money
        $add_money_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');
        $add_money_total_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->sum('request_amount');
        $today_add_money =  Transaction::toBase()
                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                            ->where('status', 1)
                            ->whereDate('created_at','>=',$this_month_start)
                            ->whereDate('created_at','<=',$this_month_end)
                            ->sum('request_amount');
        $last_month_add_money =  Transaction::toBase()->where('status', 1)
                                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 2
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 2 and date(`created_at`) >= '2025-02-01' and date(`created_at`) <= '2025-02-03'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) >= '2025-01-01' and date(`created_at`) <= '2025-01-31'
---
        }

        // Pending Add Money
        $pending_add_money_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 2)->sum('request_amount');
        $today_pending_add_money =  Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                    ->where('status', 2)
                                    ->whereDate('created_at','>=',$this_month_start)
                                    ->whereDate('created_at','<=',$this_month_end)
                                    ->sum('request_amount');
        $last_month_pending_add_money =  Transaction::toBase()->where('status', 2)
                                            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) = '2025-02-03' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) >= '2025-01-27' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) >= '2025-01-03' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) >= '2024-02-03' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and `status` = 1 and date(`created_at`) >= '2025-02-01' and date(`created_at`) <= '2025-02-03'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 1 and `type` = 'DONATION' and date(`created_at`) >= '2025-01-01' and date(`created_at`) <= '2025-01-31'
---


        // Donation
        $donation_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEDONATION)->where('status', 1)->sum('request_amount');
        $today_donation_balance = Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEDONATION)
                                    ->whereDate('created_at', $this_month_end)
                                    ->where('status', 1)
                                    ->sum('request_amount');
        $this_week_donation_balance = Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEDONATION)
                                    ->whereDate('created_at', '>=', $this_weak)
                                    ->where('status', 1)
                                    ->sum('request_amount');
        $this_month_donation_balance = Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEDONATION)
                                    ->whereDate('created_at', '>=', $this_month)
                                    ->where('status', 1)
                                    ->sum('request_amount');
        $this_year_donation_balance = Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEDONATION)
                                    ->whereDate('created_at', '>=', $this_year)
                                    ->where('status', 1)
                                    ->sum('request_amount');

        $donation_total_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEDONATION)->sum('request_amount');
        $today_donation =  Transaction::toBase()
                            ->where('type', PaymentGatewayConst::TYPEDONATION)
                            ->where('status', 1)
                            ->whereDate('created_at','>=',$this_month_start)
                            ->whereDate('created_at','<=',$this_month_end)
                            ->sum('request_amount');
        $last_month_donation =  Transaction::toBase()->where('status', 1)
                                            ->where('type', PaymentGatewayConst::TYPEDONATION)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and `status` = 2
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'DONATION' and `status` = 2 and date(`created_at`) >= '2025-02-01' and date(`created_at`) <= '2025-02-03'
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'DONATION' and date(`created_at`) >= '2025-01-01' and date(`created_at`) <= '2025-01-31'
---
        }

        // Pending Donation
        $pending_donation_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEDONATION)->where('status', 2)->sum('request_amount');
        $today_pending_donation =  Transaction::toBase()
                                    ->where('type', PaymentGatewayConst::TYPEDONATION)
                                    ->where('status', 2)
                                    ->whereDate('created_at','>=',$this_month_start)
                                    ->whereDate('created_at','<=',$this_month_end)
                                    ->sum('request_amount');
        $last_month_pending_donation =  Transaction::toBase()->where('status', 2)
                                            ->where('type', PaymentGatewayConst::TYPEDONATION)
                                            ->whereDate('created_at','>=',$last_month_start)
                                            ->whereDate('created_at','<=',$last_month_end)
                                            ->sum('request_amount');

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
---
        // $charge_percent = (($total_charge * 100) / $all_charge);

        //User
        $total_user = User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified', 0)->count();
        $active_user = User::toBase()->where('status', 1)->count();
        $banned_user = User::toBase()->where('status', 0)->count();

select count(*) as aggregate from `subscribers`
select count(*) as aggregate from `subscribers` where date(`created_at`) >= '2025-02-01' and date(`created_at`) <= '2025-02-03'
select count(*) as aggregate from `subscribers` where date(`created_at`) >= '2025-01-01' and date(`created_at`) <= '2025-01-31'
---
        }

        // Subscriber
        $total_subscriber = Subscriber::toBase()->count();
        $today_subscriber = Subscriber::toBase()
                            ->whereDate('created_at','>=',$this_month_start)
                            ->whereDate('created_at','<=',$this_month_end)
                            ->count();
        $last_month_subscriber = Subscriber::toBase()
                                        ->whereDate('created_at','>=',$last_month_start)
                                        ->whereDate('created_at','<=',$last_month_end)
                                         ->count();

select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-02-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-02-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-02-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-02-01' and `status` = 3
---
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();

select count(*) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) = '2025-02-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) = '2025-02-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) = '2025-02-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'DONATION' and date(`created_at`) = '2025-02-01' and `status` = 3
---
            $hold_data[]     = $hold;

            //Monthley Donation
            $donation_pending = Transaction::where('type', PaymentGatewayConst::TYPEDONATION)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 2)
                        ->count();
            $donation_success = Transaction::where('type', PaymentGatewayConst::TYPEDONATION)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 1)
                        ->count();
            $donation_canceled = Transaction::where('type', PaymentGatewayConst::TYPEDONATION)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 4)
                        ->count();
            $donatnion_hold = Transaction::where('type', PaymentGatewayConst::TYPEDONATION)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 3)
                        ->count();

select count(*) as aggregate from `campaigns` where `status` = 1 and date(`created_at`) = '2025-02-01'
select count(*) as aggregate from `events` where `status` = 1 and date(`created_at`) = '2025-02-01'
---
            $donatnion_hold_data[]    = $donatnion_hold;

            // Event,Campaign,Gallery
            $campaign = Campaign::where('status', 1)
            ->whereDate('created_at',$start_date)
            ->count();
            $event = Event::where('status', 1)
            ->whereDate('created_at',$start_date)
            ->count();