app/Http/Controllers/Admin/SetupPagesController.php

select * from `setup_pages` where `type` = 'setup-page'
---
    public function index()
    {
        $page_title = __("Setup Pages");
        $type = Str::slug(GlobalConst::SETUP_PAGE);
        $setup_pages = SetupPage::where('type', $type)->get();