app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->get();
---
select * from `languages` where not `code` = 'en'

    public function breadcrumbUpdate(Request $request,$slug) {
        $slug = Str::slug(SiteSectionConst::BREADCRUMB_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'breadcrumb-section' limit 1

    public function bannerUpdate(Request $request,$slug) {
        $basic_field_name = ['heading' => "required|string|max:100",'sub_heading' => "required|string|max:255",'button_name' => "required|string|max:50",'button_link' => "required|string|max:255"];

        $slug = Str::slug(SiteSectionConst::HOME_BANNER);
        $section = SiteSections::where("key",$slug)->first();


        $data['images']['banner_image'] = $section->value->images->banner_image ?? "";
        if($request->hasFile("banner_image")) {
            $data['images']['banner_image']      = $this->imageValidate($request,"banner_image",$section->value->images->banner_image ?? null);
        }



        $data['language']  = $this->contentValidate($request,$basic_field_name);
        $update_data['value']  = $data;
        $update_data['key']    = $slug;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'service-section' limit 1

    public function overviewLeftUpdate(Request $request,$slug) {

        $basic_field_name = [
            'title' => "required|string|max:300",
        ];

        $slug = Str::slug(SiteSectionConst::OVERVIEW_LEFT_SECTION);
        $section = SiteSections::where("key",$slug)->first();
        if($section != null) {
            $data = json_decode(json_encode($section->value),true);
        }else {
            $data = [];
        }

        $data['language']  = $this->contentValidate($request,$basic_field_name);

        $update_data['key']    = $slug;
        $update_data['value']  = $data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'overview-left-section' limit 1
insert into `site_sections` (`key`, `value`, `updated_at`, `created_at`) values ('overview-left-section', '{\"language\":{\"en\":{\"title\":\"Comparative Analysis\"},\"es\":{\"title\":null},\"ar\":{\"title\":null},\"fr\":{\"title\":null},\"hi\":{\"title\":null}}}', '2025-01-21 15:47:37', '2025-01-21 15:47:37')
select * from `site_sections` where (`key` = 'overview-left-section') limit 1

    public function overviewLeftItemStore(Request $request) {

        $basic_field_name = [
            'heading' => "required|string|max:500",
            'details' => "required|string|max:1000",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"about-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::OVERVIEW_LEFT_SECTION);
        $section = SiteSections::where("key",$slug)->first();

        if($section != null) {
            $section_data = json_decode(json_encode($section->value),true);
        }else {
            $section_data = [];
        }
        $unique_id = uniqid();

        $section_data['items'][$unique_id]['language'] = $language_wise_data;
        $section_data['items'][$unique_id]['id'] = $unique_id;

        $update_data['key'] = $slug;
        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'overview-left-section' limit 1
select * from `site_sections` where (`key` = 'overview-left-section') limit 1

    public function overviewLeftItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::OVERVIEW_LEFT_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => [__('Section item not found!')]]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'overview-right-section' limit 1

    public function overviewRightUpdate(Request $request,$slug) {

        $basic_field_name = [
            'title' => "required|string|max:300",
        ];

        $slug = Str::slug(SiteSectionConst::OVERVIEW_RIGHT_SECTION);
        $section = SiteSections::where("key",$slug)->first();
        if($section != null) {
            $data = json_decode(json_encode($section->value),true);
        }else {
            $data = [];
        }

        $data['language']  = $this->contentValidate($request,$basic_field_name);

        $update_data['key']    = $slug;
        $update_data['value']  = $data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where (`key` = 'overview-right-section') limit 1
insert into `site_sections` (`key`, `value`, `updated_at`, `created_at`) values ('overview-right-section', '{\"language\":{\"en\":{\"title\":\"Why Dr. Kaifala Marah?\"},\"es\":{\"title\":null},\"ar\":{\"title\":null},\"fr\":{\"title\":null},\"hi\":{\"title\":null}}}', '2025-01-21 17:56:01', '2025-01-21 17:56:01')
select * from `site_sections` where `key` = 'overview-right-section' limit 1

    public function overviewRightItemStore(Request $request,$slug) {
        $request->validate([
            'image' => "required|image|mimes:png,jpg,webp,jpeg,svg",
        ]);
        $basic_field_name = [
            'heading' => "required|string|max:255",
            'details' => "required|string|max:1000",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"about-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::OVERVIEW_RIGHT_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where (`key` = 'overview-right-section') limit 1

        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'overview-right-section' limit 1

    public function statisticsUpdate(Request $request,$slug) {

        $basic_field_name = [
            'volunteers_icon' => "required|string|max:100",
            'volunteers'      => "required|string|max:100",
            'donations_icon'  => "required|string|max:100",
            'donations'       => "required|string|max:100",
            'followers_icon'  => "required|string|max:100",
            'followers'       => "required|string|max:100",
            'likes_icon'      => "required|string|max:100",
            'likes'           => "required|string|max:100",
        ];

        $slug = Str::slug(SiteSectionConst::STATISTICS_SECTION);
        $section = SiteSections::where("key",$slug)->first();
        if($section != null) {
            $data = json_decode(json_encode($section->value),true);
        }else {
            $data = [];
        }
        $data['language']  = $this->contentValidate($request,$basic_field_name);

        $update_data['key']    = $slug;
        $update_data['value']  = $data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'about-section' limit 1

    public function aboutItemStore(Request $request,$slug) {
        $basic_field_name = [
            'title'     => "required|string|max:255",
            'link'     => "required|string|max:255"
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"about-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $section = SiteSections::where("key",$slug)->first();

        if($section != null) {
            $section_data = json_decode(json_encode($section->value),true);
        }else {
            $section_data = [];
        }
        $unique_id = uniqid();

        $section_data['items'][$unique_id]['language'] = $language_wise_data;
        $section_data['items'][$unique_id]['id'] = $unique_id;

        $update_data['key'] = $slug;
        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'about-section' limit 1
select * from `site_sections` where (`key` = 'about-section') limit 1

    public function aboutItemUpdate(Request $request,$slug) {

        $request->validate([
            'target'    => "required|string",
        ]);

        $basic_field_name = [
            'title_edit'     => "required|string|max:300",
            'link_edit'     => "required|string|max:255"
        ];

        $slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => [__('Section item not found!')]]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'about-section' limit 1

    public function aboutItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => [__('Section item not found!')]]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'download-app' limit 1

    public function partnerItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::TOP_PARTNER);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => [__('Section item not found!')]]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'contact' limit 1

    public function testimonialItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::TESTIMONIAL_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => [__('Section item not found!')]]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);

        try{
            $image_link = get_files_path('site-section') . '/' . $section_values['items'][$request->target]['image'];
            unset($section_values['items'][$request->target]);
            delete_file($image_link);
            $section->update([
                'value'     => $section_values,
            ]);
        }catch(Exception $e) {
            return back()->with(['error' => [__('Something went wrong! Please try again')]]);
        }

        return back()->with(['success' => [__('Section item delete successfully!')]]);
---
select * from `faq_sections` order by `id` desc

    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();
---
select `code`, `name` from `languages` where not `code` = 'en'